{
    "projects": [
        {
            "id": 1,
            "src": "/images/projects/pbshmiweb.png",
            "alt": "pbshmi web application",
            "name": "pbshmi web",
            "date_en": [
                2020,
                3,
                7
            ],
            "date_fa": [
                1399,
                3,
                7
            ],
            "desc_en": "SCADA solution web app. yes scada system also need web app for be alive today.in this app i convert windows app named pbshmi to web app pbshmi web for progress accessibility of pbshmi.in this app i used react and react hook to create better experience with single page application.",
            "desc_fa": "اسکادا سلوشن وب اپلیکیشن. بله امروزه حتی سیستم های اسکادا نیز نیاز دارند تا به صورت وب اپ درامده تا بتوانند نیاز های مشتری های خود را تامین کنند.من در این پروژه برنامه تحت ویندوز اکادا سیستم را به برنامه تحت وب این اپلیکیشن درباورم . در این اپلیکیشن از ری اکت و هوک های ری اکت برای هرچه بهتر شده تجربه کاربری با برنامه تحت وب استفاده شده است.",
            "features": [
                "reactjs",
                "react hook",
                "styled-components",
                "axios"
            ],
            "links": []
        },
        {
            "id": 2,
            "src": "/images/projects/marbine.png",
            "alt": "online booking Marbine",
            "name": "Marbine",
            "date_en": [
                2021,
                3,
                7
            ],
            "date_fa": [
                2021,
                3,
                7
            ],
            "desc_en": "Online booking Hotels from all over the world and it use the multi hotel booking api.in this app we combine multi hotels api like sun an odalys to prepare very complete system for user.in this app i use figma and next js to create beutifull and very fast and seo friendly application",
            "desc_fa": "ماربین یک اپلیکیشن تحت وب برای رزور انلاین هتل است که در این سامانه از چندین سامانه هتل داری دیتا گرفته شده و متصل است به صورتی که یک سیستم جامغ تر از چندین سایت هتل داری همچون سان یا اودالیس است.در این اپلیکیشن از نکست جی اس و روبی اسستفاده شده است که بخش فرانت اند و طراحی اپلیکیشن با من انجام شده است.",
            "features": [
                "nextjs",
                "ssr",
                "useSWR",
                "figma"
            ],
            "links": [
                {
                    "name_en": "view figma",
                    "name_fa": "مشاهده فیگما",
                    "withIcon": false,
                    "isActive": false,
                    "href": "https://www.figma.com/community/file/993485259219113695"
                },
                {
                    "name_en": "view website",
                    "name_fa": "مشاهده وبسایت",
                    "withIcon": true,
                    "isActive": true,
                    "href": "sejour.ir"
                }
            ]
        }
    ]
}